# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
brew 'ansible'
brew 'php'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'meilisearch'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'nvm'
brew 'redis'

# Apps
cask 'dbngin'
cask 'sequel-ace'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'microsoft-edge'
cask 'microsoft-teams'
cask 'libreoffice'
cask 'insomnia'
cask 'iterm2'
cask 'phpmon'
cask 'phpstorm'
cask 'ray'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-fira-code'
cask 'font-inconsolata'

# Mac App Store
mas 'Gifski', id: 1351639930
mas 'Lightshot Screenshot', id: 526298438
mas 'Dato', id: 1470584107
mas 'Magnet', id: 441258766
mas 'Pasta', id: 1438389787
